# 命令行工具

## 1 命令行工具
通过`knext`命令行工具，以及定义的多个子命令，实现完整的图谱构建与使用流程。

```bash
# show the user maual

$ knext --help
Usage: knext [OPTIONS] COMMAND [ARGS]...

Options:
  --version  Show the version and exit.
  --help     Show this message and exit.

Commands:
  project   Project client.
  reasoner  Reasoner client.
  schema    Schema client.
  thinker   Thinker client.
```

### 1.1 project
```bash
# show the user maual
$ knext project --help
Usage: knext project [OPTIONS] COMMAND [ARGS]...

  Project client.

Options:
  --help  Show this message and exit.

Commands:
  create   Create new project with a demo case.
  list
  restore
  update
```

#### 1.1.1 创建项目
```bash
# show the user maual
$ knext project create --help

Usage: knext project create [OPTIONS]

  Create new project with a demo case.

Options:
  --config_path TEXT        Path of config.  [required]
  --tmpl [default|medical]  Template of project, use default if not specified.
  --help                    Show this message and exit.
```

+ 【必填】--config_path，项目配置文件路径

使用实例：

```bash
# show the user maual
$ knext project create --config_path kag_config.yaml
```



结果：  
执行成功后会在当前目录下创建出`KagDemo`目录，执行`cd KagDemo`进入示例项目。

```plain
.
├── builder
│   ├── __init__.py
│   ├── data
│   ├── indexer.py
│   └── prompt
├── kag_config.yaml
├── reasoner
│   └── __init__.py
├── schema
│   ├── KagDemo.schema
│   └── __init__.py
└── solver
    ├── __init__.py
    └── prompt
```



#### 1.1.2 恢复项目
使用此命令可以根据以存在的项目目录，快速恢复项目。

```bash
# show the user maual
$ knext project restore --help

Usage: knext project restore [OPTIONS]

Options:
  --host_addr TEXT  Address of spg server.
  --proj_path TEXT  Path of config.
  --help            Show this message and exit.
```

+ --proj_path，项目文件夹根路径，默认为当前目录。
+ --host_addr，SPG server的地址，默认为yaml中配置的host_addr。

使用实例：

```bash
$ knext project restore --proj_path KagDemo --host_addr http://127.0.0.1:8887
```



结果：

yaml文件中会在[project]下新增id。当Server存在该项目时，返回该项目id。当Server不存在该项目时，新建项目并返回id。

#### 1.1.3 更新项目配置
当kag_config.yaml更新时，需要执行该命令将配置同步到SPG Server。

```bash
# show the user maual
$ knext project update --help

Usage: knext project update [OPTIONS]

Options:
  --proj_path TEXT  Path of config.
  --help            Show this message and exit.
```

+ --proj_path，项目文件夹根路径，默认为当前目录。

使用实例：

```bash
knext project update --proj_path KagDemo
```

#### 1.1.4 查看项目列表
可以查看当前服务器上的项目列表：

```shell
# show the user manual

$ knext project list --host_addr http://127.0.0.1:8887

Project Name | Project ID
-------------------------
RiskMining           | 1         
SupplyChain          | 2         
TwoWiki              | 3         
Medicine             | 4         
EventDemo            | 5         
HotpotQA             | 6 
```

+ --host_addr，SPG server地址，默认为[http://127.0.0.1:8887](http://127.0.0.1:8887)

### 1.2 schema
```bash
# show the user maual
$ knext schema --help

Usage: knext schema [OPTIONS] COMMAND [ARGS]...

  Schema client.

Options:
  --help  Show this message and exit.

Commands:
  commit            Commit local schema and generate schema helper.
  reg_concept_rule  Register a concept rule according to DSL file.
```

#### 1.2.1 提交schema
当项目被创建或重载后，或者schema文件有更新后，需要执行该命令将schema同步到SPG Server。

```bash
# show the user maual
$ knext schema commit --help

Usage: knext schema commit [OPTIONS]

  Commit local schema and generate schema helper.

Options:
  --help  Show this message and exit.
```

#### 1.2.2 提交概念规则
```bash
# show the user maual
$ knext schema reg_concept_rule --help

Usage: knext schema reg_concept_rule [OPTIONS]

  Register a concept rule according to DSL file.

Options:
  --file TEXT  Path of DSL file.
  --help       Show this message and exit.
```



+ 【必填】--file concept rule文件路径

使用实例：  
schema/concept.rule

```plain
namespace DEFAULT

`TaxOfRiskApp`/`赌博应用`:
    rule: [[
        ...
    ]]
```

执行命令：

```bash
$ knext schema reg_concept_rule --file schema/concept.rule
```

结果：

```plain
Defined belongTo rule for ...
...
Concept rule is successfully registered.
```

### 1.3 reasoner
```bash
$ knext reasoner --help

Usage: knext reasoner [OPTIONS] COMMAND [ARGS]...

  Reasoner client.

Options:
  --help  Show this message and exit.

Commands:
  execute   Query dsl by providing a string or file.
```



#### 1.3.1 执行推理任务
```bash
$ knext reasoner execute [--file] [--dsl]
```



+ 【二选一】--file 查询的dsl文件。
+ 【二选一】--dsl 查询的dsl语法，用双引号括起来。

使用实例：  
reasoner/demo.dsl:

```bash
MATCH (s:Demo.Company)
RETURN s.id, s.address
```

执行命令：

```bash
$ knext reasoner execute --file reasoner/demo.dsl
```

结果：

```plain
"s.id","s.address"
"00","浙江省杭州市西湖区"
```





